# FillVisible Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystemType..::..FillVisible Property
MEPSystemType Class See Also
---
Indicates the visibility of the fill pattern for all components in the system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool FillVisible { get; set; }
```

Visual Basic
---
```text
Public Property FillVisible As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool FillVisible {
	bool get ();
	void set (bool value);
}
```

# See Also
MEPSystemType Class
Autodesk.Revit.DB Namespace